app/controllers/conquest_controller.rb

SELECT `incomes`.* FROM `incomes`
---
	def income
		@data = Income.all

SELECT `assets`.* FROM `assets`
---
	def asset
		@data = Asset.all

SELECT `liabilities`.* FROM `liabilities`
---
	def liability
		@data = Liability.all

SELECT `equities`.* FROM `equities`
---
	def equity
		@data = Equity.all

SELECT `credits`.* FROM `credits`
---
	def credit
		@data = Credit.all

SELECT `incomes`.* FROM `incomes`
SELECT `assets`.* FROM `assets`
SELECT `liabilities`.* FROM `liabilities`
SELECT `equities`.* FROM `equities`
SELECT `credits`.* FROM `credits`
---
	def get_data
		name = params[:name]
		data = nil;
		if( name == "income")
			data = Income.all
		elsif (name == "asset")
			data = Asset.all
		elsif (name == "liability")
			data = Liability.all
		elsif (name == "equity")
			data = Equity.all
		elsif (name == "credit")
			data = Credit.all